test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lam="http://lameduck.dtu/">
  <soapenv:Body>
    <lam:bookFlight>
      <bookingNumber>1234</bookingNumber>
      <!--Optional:-->
      <creditcardNumber>1234567891234567</creditcardNumber>
      <!--Optional:-->
      <creditcardName>Rasmus</creditcardName>
      <expirationMonth>11</expirationMonth>
      <expirationYear>20</expirationYear>
    </lam:bookFlight>
  </soapenv:Body>
</soapenv:Envelope>